{
  "beginner": [
    {
      "accuracy_rate": "~93%",
      "pose": "Warrior's Stance",
      "description": "The Warrior's Stance, or Warrior 1 Pose, is a standing yoga posture designed to cultivate focus, power, and stability. This foundational pose extends the front side of the body, enhancing strength in the legs, core, and back.",
      "youtube_link": "link",
      "instructions": "1. From a High Lunge pose with the right knee bent, engage the legs, grounding down through the feet. Inhale, raising the hands to the bent knee, using the arms to draw the torso back slightly. Ensure the right knee is directly over the right ankle.\n\n2. Bring hands to the hips, square hips and shoulders to the front wall, relaxing the shoulders, and drawing the shoulder blades toward the spine to open the chest.\n\n3. Inhale, extending the arms overhead in an 'H' position with palms facing each other. Alternatively, bring palms together with crossed thumbs or interlace fingers, pointing the index finger upward. Keep the shoulders relaxed and the chest lifted.\n\n4. For a deeper stretch, bring palms together, carefully arch back, and gaze upward.\n\n5. Inhale deeply into the belly and chest, exhale, pressing into the feet, fingers, and crown, feeling your body expanding in five directions.\n\n6. Maintain steady breathing, holding for 3-6 breaths.\n\n7. To release, exhale and lower the hands down to the floor."
    },
    {
      "accuracy_rate": "~100%",
      "pose": "Tree Pose",
      "description": "Elevated Balance, often underestimated in its simplicity, serves as a crucial yoga pose for building a strong foundation. It is considered the starting point for various standing yoga positions.",
      "youtube_link": "https://www.youtube.com/watch?v=2HTvZp5rPrg",
      "instructions": "1. Stand with your feet a few inches apart and parallel. Alternatively, stand with heels slightly apart and the bases of your big toes touching.\n\n2. Lift and spread your toes, gently placing them back on the floor. Rock gently from side to side and back again. Gradually bring the swaying to a stop, distributing your weight equally across your feet. Feel the energy rising through your core from your feet.\n\n3. Spread your collarbones, lift the top of your sternum straight up toward the sky without pulling your lower front ribs forward. Let your shoulder blades draw inward and away from your ears.\n\n4. Place your arms at your sides with palms facing either inward or outward.\n\n5. Keep your tongue wide and flat on the floor of your mouth, relax your throat, and align the crown of your head directly over the center of your pelvis. Breathe."
    },
    {
      "accuracy_rate": "~86%",
      "pose": "Cat Pose",
      "description": "The Feline Stretch, also known as Chakravakasana, is an essential yoga practice for a good reason. It involves a rhythmic movement of the spine, transitioning from a rounded position (flexion) to an arched one (extension), all synchronized with the breath.",
      "instructions": "1. Start in Tabletop with hips directly over your knees, hands shoulder-distance apart, slightly ahead of your shoulders, and wrists parallel to the front of the mat.\n\n2. Press down firmly through your hands.\n\n3. Exhale, rounding your spine toward the ceiling, dropping the crown of your head and your tailbone. Draw your lower belly in and up.\n\n4. Push the floor away with your hands to broaden across your shoulder blades.\n\n5. Keep the hips over your knees and your arms straight, maintaining the movement in your spine.\n\n6. To release the pose, return to a neutral spine."
    },
    {
      "accuracy_rate": "~86%",
      "pose": "Cow Pose",
      "description": "Graceful Cow, scientifically known as Bitilasana, is a backbend often paired with the Cat Pose at the onset of a vinyasa flow. This pose serves to warm up the body, particularly the spine, and offers relief to the upper body, including the back, shoulders, and neck.",
      "youtube_link": "link",
      "instructions": "1. Begin on your hands and knees in a table pose with a neutral spine. Inhale and move into Cow Pose, lifting your sit bones upward, pressing your chest forward, and allowing your belly to sink.\n\n2. Lift your head, relax your shoulders away from your ears, and gaze straight ahead.\n\n3. As you exhale, transition into Cat Pose by rounding your spine outward, tucking in your tailbone, and drawing your pubic bone forward.\n\n4. Release your head toward the floor—avoid forcing your chin to your chest. Most importantly, relax."
    }
  ],
  "intermediate": [
    {
      "accuracy_rate": "~86%",
      "pose": "Cat Pose",
      "description": "The Feline Stretch, also known as Chakravakasana, is an essential yoga practice for a good reason. It involves a rhythmic movement of the spine, transitioning from a rounded position (flexion) to an arched one (extension), all synchronized with the breath.",
      "instructions": "1. Begin in Tabletop with hips directly over your knees, hands shoulder-distance apart, slightly ahead of your shoulders, and wrists parallel to the front of the mat.\n\n2. Press down firmly through your hands.\n\n3. Exhale, rounding your spine toward the ceiling, dropping the crown of your head and your tailbone. Draw your lower belly in and up.\n\n4. Push the floor away with your hands to broaden across your shoulder blades.\n\n5. Keep the hips over your knees and your arms straight, maintaining the movement in your spine.\n\n6. Release the pose by returning to a neutral spine."
    },
    {
      "accuracy_rate": "~86%",
      "pose": "Cow Pose",
      "description": "Graceful Cow, scientifically known as Bitilasana, is a backbend often paired with the Cat Pose at the onset of a vinyasa flow. This pose serves to warm up the body, particularly the spine, and offers relief to the upper body, including the back, shoulders, and neck.",
      "youtube_link": "link",
      "instructions": "1. Start on your hands and knees in a table pose with a neutral spine. Inhale and transition into Cow Pose, lifting your sit bones upward, pressing your chest forward, and allowing your belly to sink.\n\n2. Lift your head, relax your shoulders away from your ears, and gaze straight ahead.\n\n3. As you exhale, move into Cat Pose by rounding your spine outward, tucking in your tailbone, and drawing your pubic bone forward.\n\n4. Release your head toward the floor—avoid forcing your chin to your chest. Most importantly, relax."
    },
    {
      "accuracy_rate": "~91%",
      "pose": "Standing Forward",
      "description": "Initiate with a mountainous position, feet hip-width apart, and knees bent. Inhale deeply, then exhale, gradually folding over the legs. Hands may descend to the knees, shins, or ankles. This pose fosters spinal flexibility, aids digestion, and reduces abdominal tension as the belly rests on the thighs.",
      "youtube_link": "https://www.youtube.com/watch?v=0kOOvLPN23Q",
      "instructions": "1. Start with hands at your hips in Tadasana (Mountain Pose) at the front of the mat.\n\n2. With your torso folded over your legs and slightly bent knees, hinge from your hips rather than your lower back.\n\n3. Your hands may touch the ground in front of you or next to your feet.\n\n4. Inhale, lift your chest to lengthen your spine.\n\n5. Exhale, slowly straighten both legs without hyperextending them. Spiral your upper and inner thighs back while lifting your kneecaps.\n\n6. Extend your torso downward without curving your back as you exhale. Draw your shoulders down toward your hips, lengthening your neck and stretching the crown of your head downward."
    }
  ],
  "advanced": [
    {
      "accuracy_rate": "~86%",
      "pose": "Cat Pose",
      "description": "The Feline Stretch, also known as Chakravakasana, is an essential yoga practice for a good reason. It involves a rhythmic movement of the spine, transitioning from a rounded position (flexion) to an arched one (extension), all synchronized with the breath.",
      "instructions": "1. Begin in Tabletop with hips directly over your knees, hands shoulder-distance apart, slightly ahead of your shoulders, and wrists parallel to the front of the mat.\n\n2. Press down firmly through your hands.\n\n3. Exhale, rounding your spine toward the ceiling, dropping the crown of your head and your tailbone. Draw your lower belly in and up.\n\n4. Push the floor away with your hands to broaden across your shoulder blades.\n\n5. Keep the hips over your knees and your arms straight, maintaining the movement in your spine.\n\n6. Release the pose by returning to a neutral spine."
    },
    {
      "accuracy_rate": "~86%",
      "pose": "Cow Pose",
      "description": "Graceful Cow, scientifically known as Bitilasana, is a backbend often paired with the Cat Pose at the onset of a vinyasa flow. This pose serves to warm up the body, particularly the spine, and offers relief to the upper body, including the back, shoulders, and neck.",
      "youtube_link": "link",
      "instructions": "1. Start on your hands and knees in a table pose with a neutral spine. Inhale and transition into Cow Pose, lifting your sit bones upward, pressing your chest forward, and allowing your belly to sink.\n\n2. Lift your head, relax your shoulders away from your ears, and gaze straight ahead.\n\n3. As you exhale, move into Cat Pose by rounding your spine outward, tucking in your tailbone, and drawing your pubic bone forward.\n\n4. Release your head toward the floor—avoid forcing your chin to your chest. Most importantly, relax."
    },
    {
      "accuracy_rate": "~93%",
      "pose": "Warrior Pose",
      "description": "The Warrior's Stance, or Warrior 1 Pose, is a standing yoga posture designed to cultivate focus, power, and stability. This foundational pose extends the front side of the body, enhancing strength in the legs, core, and back.",
      "youtube_link": "link",
      "instructions": "1. From a High Lunge pose with the right knee bent, engage the legs, grounding down through the feet. Inhale, raising the hands to the bent knee, using the arms to draw the torso back slightly. Ensure the right knee is directly over the right ankle.\n\n2. Bring hands to the hips, square hips and shoulders to the front wall, relaxing the shoulders, and drawing the shoulder blades toward the spine to open the chest.\n\n3. Inhale, extending the arms overhead in an 'H' position with palms facing each other. Alternatively, bring palms together with crossed thumbs or interlace fingers, pointing the index finger upward. Keep the shoulders relaxed and the chest lifted.\n\n4. For a deeper stretch, bring palms together, carefully arch back, and gaze upward.\n\n5. Inhale deeply into the belly and chest, exhale, pressing into the feet, fingers, and crown, feeling your body expanding in five directions.\n\n6. Maintain steady breathing, holding for 3-6 breaths.\n\n7. To release, exhale and lower the hands down to the floor."
    },
    {
      "accuracy_rate": "~99%",
      "pose": "Warrior's 2 Pose",
      "description": "Warrior's Posture 2, or Warrior 2 Pose, is a standing strength pose designed to invigorate the body and mind, enhancing concentration and stamina. This posture strengthens the legs while opening the chest and hips.",
      "youtube_link": "link",
      "instructions": "1. From Five Pointed Star, turn the right toe to the right wall and bend the right knee directly over the right ankle.\n\n2. Turn the hips and shoulders towards the front, reaching out through the fingertips toward the side walls. Turn and look at the right middle finger.\n\n3. Press into the feet, maintaining strong legs. Sink the hips toward the floor, reaching the crown of the head up to lengthen the spine. Relax the shoulders down and back, pressing the chest forward.\n\n4. Breathe and hold for 3-6 breaths.\n\n5. To release, straighten the legs and turn the feet forward, returning to\n\n7. Repeat on the other side."
    }
  ]
}